ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
void install_overrides(void)
{
	for (int i = 0; i < ARRAY_SIZE(overrides); i++) {
		ets_printf("Patching function %p -> %p\n",
			overrides[i].old_fn,
			overrides[i].new_fn);
		try_patch((uint32_t)overrides[i].old_fn, (uint32_t)overrides[i].new_fn);
	}
}

#if 1
/* Test: These support functions for ISSI and GD25Q32C are not small.
 * Since my flash is Winbond, it should work fine wihtout them.
 * This reduces the irom0text size from 28928 to 27696 (~1.2KiB / 4.2%).
 */
void spi_flash_issi_enable_QIO_mode(void) { }
void flash_gd25q32c_read_status(void) { }
void flash_gd25q32c_write_status(void) { }
#endif

/* Cache_Read_Enable:
  mb_region = 0, odd_even = 0 -> map first 8Mbit of flash
  mb_region = 0, odd_even = 1 -> map second 8Mbit of flash
  mb_region = 1, odd_even = 0 -> map third 8Mbit of flash
  mb_region = 1, odd_even = 1 -> map fourth 8Mbit of flash
  cache_size:
     SOC_CACHE_SIZE 0 // 16KB
     SOC_CACHE_SIZE 1 // 32KB
 */
extern void Cache_Read_Enable(uint8_t odd_even, uint8_t mb_region, uint8_t cache_size);

static bool cache_map;

static void
relib_reset_uart_baud(int clk)
{
	/* Wait for UART tx fifo to drain */
	while ((UART0->STATUS & 0xff0000) != 0);
#if 0
	/* Upclock PLL to 80MHz AHB freq */
	rom_i2c_writeReg(103, 4, 1, 0x88);
	rom_i2c_writeReg(103, 4, 2, 0x91);
	/* uart_div_modify also resets the fifos, but we already flushed it */
	UART0->CLKDIV = NORMAL_CLK_FREQ / UART_BAUDRATE;
	/* Wait a bit for clock to stabilize */
	ets_delay_us(1000);
#else
	UART0->CLKDIV = clk / UART_BAUDRATE;
#endif
}

extern int chip_version;

int ICACHE_FLASH_ATTR
get_chip_version(void)
{
	if (chip_version == -1) {
		uint32_t x;
		if (EFUSE->DATA[2] & 0x8000) {
			x = EFUSE->DATA[1];
		} else {
			x = EFUSE->DATA[3];
		}
		chip_version = (x >> 24) & 0xf;
	}

	return chip_version;
}

void ICACHE_FLASH_ATTR
sleep_opt_8266(uint32_t r1, uint32_t sw_reset, uint32_t reset_ctl)
{
	RTC->R40 = 0;
	RTC->R44 = r1;
	RTC->SW_RESET = sw_reset;
	RTC->RESET_CTL = reset_ctl;
}

void ICACHE_FLASH_ATTR
sleep_opt_bb_on_8266(void)
{
	if (get_chip_version() == 2) {
		sleep_opt_8266(0, 0, 0x00800000);
	} else {
		sleep_opt_8266(0, 0, 0x00800050);
	}
}

void ICACHE_FLASH_ATTR
pm_wakeup_opt(uint32_t reg18, uint32_t rega8)
{
	RTC->WAKEUP_HW_CAUSE_REG = (RTC->WAKEUP_HW_CAUSE_REG & ~0x3f) | reg18;
	RTC->RA8 = (RTC->RA8 & ~1) | rega8;
}

void ICACHE_FLASH_ATTR
pm_set_pll_xtal_wait_time(void)
{
	if (get_chip_version() < 2) {
		RTC->XTAL_WAIT_TIME = 0xc8064;
	} else {
		RTC->XTAL_WAIT_TIME = 0x3203c;
	}
}

extern uint8_t periodic_cal_sat;

void ICACHE_FLASH_ATTR
pm_set_sleep_cycles(int rtc_cycles)
{
	/* Set the target value of RTC_COUNTER for wakeup from light-sleep/deep-sleep */
	RTC->SLP_VAL /* target */ = rtc_cycles + RTC->SLP_CNT_VAL /* current count */;
	periodic_cal_sat = 5000 < rtc_cycles;
}

extern uint8_t software_slp_reject;;
extern uint8_t hardware_reject;

void ICACHE_FLASH_ATTR
pm_wait4wakeup(int param)
{
	if (!(((param == 1) || (param == 2)) && (software_slp_reject == 0))) {
		return;
	}
	while ((RTC->SLP_STATE & 3) == 0);
	hardware_reject = RTC->SLP_STATE & 2;
}

void ICACHE_FLASH_ATTR
sleep_reset_analog_rtcreg_8266(void)
{
	RTC->INT_CLR = 0xffffffff;
	sleep_opt_bb_on_8266();
	pm_wakeup_opt(8,0);
	pm_set_pll_xtal_wait_time();
	pm_set_sleep_cycles(1000);

	RTC->SLP_CTL |= 0x100000; /* trigger wakeup? */
	pm_wait4wakeup(2);

	RTC->SW_RESET = 0x0019c06a;

	/* Note: This overrides the value set by pm_set_sleep_cycles() above */
	RTC->SLP_VAL = 0xfff;
	RTC->SLP_CTL = 0;

	/* Note: This overrides the value set by pm_set_pll_xtal_wait_time() above */
	RTC->XTAL_WAIT_TIME = 0x640c8;

	RTC->RESET_CTL = 0xf0000000;
	RTC->WAKEUP_HW_CAUSE_REG = 4;
	RTC->INT_ENA = 0;
	RTC->R40 = 0;
	RTC->R44 = 0;
	RTC->R48 = 0x20302020;
	RTC->R4C = 0x20500000;
	RTC->R58 = 0;
	RTC->R5C = 7;
	RTC->R60 = 7;
	RTC->R64 = 0;
	RTC->GPIO_OUT = 0;
	RTC->GPIO_ENABLE = 0;
	RTC->R80 = 0;
	RTC->GPIO_CONF = 0;
	RTC->R94 = 0;
	RTC->R98 = 0;
	RTC->R9C = 0;
	RTC->XPD_DCDC_CONF = 0;
	RTC->RA8 = 0;
	RTC->RAC = 0;
	RTC->RB0 = 0;
	RTC->RB4 = 0;
}

static bool
userbin_check(struct boot_hdr *bhdr)
{
	if (bhdr->use_bin == 1) {
		if (bhdr->boot_status == 0) {
			return 0;
		}
	} else if (bhdr->boot_status != 0) {
		return 0;
	}
	return 1;
}

void
Cache_Read_Enable_New(void)
{
	int user_iram = user_iram_memory_is_enabled(); /* returns 0, weak symbol? */
	Cache_Read_Enable(cache_map, 0, !user_iram);
}

static uint8_t
system_get_checksum(void *src, int len)
{
	uint8_t csum = 0xef;
	uint8_t *p = src;

	while (len--) {
		csum ^= *p++;
	}
	return csum;
}

static void
print_system_param_sectors(int start_sector)
{
	ets_printf("system param error, use last saved param!\n");
}

static void
init_bss_data(void)
{
	/* Zero BSS section */
	ets_bzero(&_bss_start, &_bss_end - &_bss_start);
}

int ICACHE_FLASH_ATTR
relib_read_macaddr_from_otp(uint8_t *mac) /* impl. from RTOS SDK */
{
	uint32_t efuse[4];

	uint8_t efuse_crc = 0;
	uint8_t calc_crc = 0;
	uint8_t version;
	uint8_t use_default = 1;

	efuse[0] = EFUSE->DATA[0];
	efuse[1] = EFUSE->DATA[1];
	efuse[2] = EFUSE->DATA[2];
	efuse[3] = EFUSE->DATA[3];

	mac[3] = efuse[1] >> 8;
	mac[4] = efuse[1];
	mac[5] = efuse[0] >> 24;

	if (efuse[2] & EFUSE_IS_48BITS_MAC) {
		uint8_t tmp_mac[4];

		mac[0] = efuse[3] >> 16;
		mac[1] = efuse[3] >> 8;
		mac[2] = efuse[3];

		use_default = 0;

		tmp_mac[0] = mac[2];
		tmp_mac[1] = mac[1];
		tmp_mac[2] = mac[0];

		efuse_crc = efuse[2] >> 24;
		calc_crc = esp_crc8(tmp_mac, 3);

		if (efuse_crc != calc_crc)
			use_default = 1;

		if (!use_default) {
			version = (efuse[1] >> EFUSE_VERSION_S) & EFUSE_VERSION_V;

			if (version == EFUSE_VERSION_1 || version == EFUSE_VERSION_2) {
				tmp_mac[0] = mac[5];
				tmp_mac[1] = mac[4];
				tmp_mac[2] = mac[3];
				tmp_mac[3] = efuse[1] >> 16;

				efuse_crc = efuse[0] >> 16;
				calc_crc = esp_crc8(tmp_mac, 4);

				if (efuse_crc != calc_crc)
					use_default = 1;
			}
		}
	}

	if (use_default) {
		mac[0] = 0x18;
		mac[1] = 0xFE;
		mac[2] = 0x34;
	}

	return 0;
}

#if 1
void ICACHE_FLASH_ATTR
relib_user_local_init(void)
{
	uint8_t bVar1;
	char cVar2;
	bool bVar3;
	uint8_t uVar4;
	int iVar5;
	void *pv;
	uint32_t uVar6;
	phy_init_and_rf_cal_st *phy_rf_data;
	char *rf_cal_data;
	char cVar8;
	char cVar9;

	_xtos_set_exception_handler(9,user_fatal_exception_handler);
	_xtos_set_exception_handler(0,user_fatal_exception_handler);
	_xtos_set_exception_handler(2,user_fatal_exception_handler);
	_xtos_set_exception_handler(3,load_non_32_wide_handler);
	_xtos_set_exception_handler(0x1c,user_fatal_exception_handler);
	_xtos_set_exception_handler(0x1d,user_fatal_exception_handler);
	_xtos_set_exception_handler(8,user_fatal_exception_handler);
	DPRINTF("sleep_reset_analog_rtcreg_8266\n");
	sleep_reset_analog_rtcreg_8266();  /* resets clocks, so re-init uart after */
	relib_reset_uart_baud(BOOT_CLK_FREQ);
	user_pre_init();
	iVar5 = read_macaddr_from_otp(info.sta_mac);
	if (iVar5 == 0) {
		iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
		if (iVar5 != 0) {
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup\n");
			system_save_sys_param();
		}
	}
	else {
		bVar1 = g_ic.ic_profile.mac_bakup[0] & 1;
		if ((g_ic.ic_profile.mac_bakup[0] & 1) == 0) {
			iVar5 = memcmp(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
			if (iVar5 == 0) {
				os_printf_plus("Ce\n");
			}
			else if (bVar1 == 0) {
				memcpy(info.sta_mac,g_ic.ic_profile.mac_bakup,6);
				os_printf_plus("Load\n");
			}
		}
		else {
			if (iVar5 == -1) {
				info.sta_mac[0] = '\\';
				info.sta_mac[1] = 0xcf;
				info.sta_mac[2] = '\x7f';
			}
			memcpy(g_ic.ic_profile.mac_bakup,info.sta_mac,6);
			os_printf_plus("Backup default %d\n",iVar5);
			system_save_sys_param();
		}
	}
	wifi_set_backup_mac(info.sta_mac);
	wifi_softap_cacl_mac(info.softap_mac, info.sta_mac);
	info.softap_info.ip.addr = 0x104a8c0; /* 192.168.4.1 */
	info.softap_info.gw.addr = 0x104a8c0;
	info.softap_info.netmask.addr = 0xffffff;
	DPRINTF("ets_timer_init\n");
	ets_timer_init();
	DPRINTF("lwip_init\n");
	lwip_init();
	espconn_init();
	lwip_timer_interval = 25; /* 25ms */
	ets_timer_setfn(&check_timeouts_timer,sys_check_timeouts,0);
	DPRINTF("user_init_default_profile\n");
	user_init_default_profile();
	if ((DPORT->PERI_IO_SWAP & 1) == 0) {
		system_uart_de_swap();
	} else {
		system_uart_swap();
	}
	uVar6 = RTC->STORE[0];
	while ((UART0->STATUS & 0xff0000) != 0);
	while ((UART1->STATUS & 0xff0000) != 0);
	IOMUX->GPIO0 &= 0xfffffeff;  /* Switch from CLK_OUT to GPIO */
	IOMUX->GPIO2 &= 0xfffffeff;  /* Switch from U0TXD_BK to GPIO */
	system_rtc_mem_read(0,&rst_if,0x1c);
	if (uVar6 == 0) {
		uVar6 = rtc_get_reset_reason();
		if (uVar6 == 1) {
			memset(&rst_if,0,0x1c);
		}
		else {
			uVar6 = rtc_get_reset_reason();
			if (uVar6 == 2) {
				if (((rst_if.flag != 5) || (rst_if.epc1 != 0)) || (rst_if.excvaddr != 0)) {
					memset(&rst_if,0,0x1c);
					rst_if.flag = 6;
				}
			}
			else {
				rtc_get_reset_reason();
			}
		}
	}
	else if (6 < uVar6) {
		memset(&rst_if,0,0x1c);
	}
	system_rtc_mem_write(0,&rst_if,0x1c);
	DPRINTF("read phy and rf cal data\n");
	phy_rf_data = os_zalloc_dram(sizeof(*phy_rf_data));
	spi_flash_read(flashchip->sector_size * system_phy_init_sector,(void*)phy_rf_data,0x80);
	rf_cal_data = (void*)&phy_rf_data->rf_cal;
	spi_flash_read(flashchip->sector_size * system_rf_cal_sector,(void*)rf_cal_data,0x274);
	phy_rx_gain_dc_table = phy_rf_data->rf_cal.rx_gain_dc_table;
	iVar5 = flash_data_check(rf_cal_data);
	if ((iVar5 == 0) && (iVar5 = phy_check_data_table(phy_rx_gain_dc_table,0x7d,1), iVar5 == 0)) {
		bVar3 = false;
	}
	else {
		bVar3 = true;
	}
	if (rst_if.flag != 5) {
		phy_afterwake_set_rfoption(1);
	}
	if ((rst_if.flag != 5) && (!bVar3)) {
		write_data_to_rtc(rf_cal_data);
	}
	if (phy_rf_data->phy_init.param_ver_id == '\x05') {
		cVar9 = '\v';
		cVar2 = phy_rf_data->pad1[0x71];
		if (freq_trace_enable == false) {
			uVar6 = phy_rf_data->pad1[0x70];
			if (((uVar6 < 2) && (-1 < (int)uVar6)) || (uVar6 == 3)) {
LAB_4022f98c:
				phy_rf_data->pad1[0x70] = '\0';
			}
			else {
				cVar9 = '\a';
				if (uVar6 == 5) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->pad1[0x71] = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else if (uVar6 == 7) {
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->pad1[0x71] = '\0';
					}
				}
				else if (uVar6 == 9) {
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							cVar9 = '\0';
							phy_rf_data->pad1[0x71] = '\0';
						}
						else {
							cVar9 = '\x05';
						}
					}
				}
				else {
					if (uVar6 != 0xb) goto LAB_4022f98c;
					if (-1 < cVar2) {
						cVar9 = '\0';
						phy_rf_data->pad1[0x71] = '\0';
					}
				}
				phy_rf_data->pad1[0x70] = cVar9;
			}
		}
		else if (freq_trace_enable == true) {
			bVar1 = phy_rf_data->pad1[0x70];
			cVar8 = '\x03';
			if ((1 < bVar1) && (bVar1 != 3)) {
				if (bVar1 == 5) {
					cVar8 = cVar9;
					if ((-1 < cVar2) && (cVar8 = '\t', cVar2 < '\a')) {
						phy_rf_data->pad1[0x71] = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 7) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						phy_rf_data->pad1[0x71] = '\0';
						cVar8 = '\x03';
					}
				}
				else if (bVar1 == 9) {
					cVar8 = cVar9;
					if (-1 < cVar2) {
						if (cVar2 < '\a') {
							phy_rf_data->pad1[0x71] = '\0';
							cVar8 = '\x03';
						}
						else {
							cVar8 = '\t';
						}
					}
				}
				else if ((bVar1 == 0xb) && (cVar8 = cVar9, -1 < cVar2)) {
					phy_rf_data->pad1[0x71] = '\0';
					cVar8 = '\x03';
				}
			}
			phy_rf_data->pad1[0x70] = cVar8;
		}
		DPRINTF("chip_init\n");
		chip_init(phy_rf_data, info.sta_mac);  /* resets clocks, so re-init uart */
		relib_reset_uart_baud(NORMAL_CLK_FREQ);
	}
	else {
		os_printf_plus("rf_cal[0] !=0x05,is 0x%02X\n");
		ets_delay_us(10000);
		system_restart_local();
	}
	g_ic.phy_function = (phy_rf_data->pad1[0x70] & 5U) == 1;
	os_printf_plus("rf cal sector: %d\n",system_rf_cal_sector);
	os_printf_plus("freq trace enable %d\n",freq_trace_enable);
	os_printf_plus("rf[112] : %02x\n", phy_rf_data->pad1[0x70]);
	os_printf_plus("rf[113] : %02x\n", phy_rf_data->pad1[0x71]);
	os_printf_plus("rf[114] : %02x\n", phy_rf_data->pad1[0x72]);
	if ((bVar3) &&
		 (((rst_if.flag != 5 && (uVar6 = rtc_get_reset_reason(), uVar6 == 2)) ||
			(uVar6 = rtc_get_reset_reason(), uVar6 == 1)))) {
		os_printf_plus("w_flash\n");
		get_data_from_rtc(rf_cal_data);
		wifi_param_save_protect_with_check(
			system_rf_cal_sector,
			flashchip->sector_size,
			rf_cal_data,
			0x274);
	}
	vPortFree(phy_rf_data,"app_main.c",0x53b);
	os_printf_plus("\nSDK ver: %s compiled @ Oct	9 2021 09:52:05\n",
		"3.0.5(b29dcd3)");
	uint32_t phy_ver = RTCMEM->BACKUP[0x7c/4];
	uint32_t pp_ver = RTCMEM->SYSTEM[0xf8/4];
	os_printf_plus("phy ver: %d_%d, pp ver: %d.%d\n\n",
		(phy_ver >> 0x10) & 0xfff, phy_ver >> 0x1c,
		(pp_ver & 0xff00) >> 8, pp_ver & 0xff);
	if ((g_ic.phy_function & 1) != 0) {
		uint32_t freq_cal = RTCMEM->BACKUP[0x78/4];
		if (rst_if.flag == 5) {
			TestStaFreqCalValInput = freq_cal >> 0x10;
			chip_v6_set_chan_offset(1, TestStaFreqCalValInput);
			TestStaFreqCalValDev = TestStaFreqCalValInput;
		}
		else {
			TestStaFreqCalValInput = 0;
			RTCMEM->BACKUP[0x78/4] = freq_cal & 0xffff;
		}
	}
	system_rtc_mem_write(0,pv,0x1c);
	vPortFree(pv,"app_main.c",0x571);
	wdt_init(1);
	user_init();
	ets_timer_disarm(&check_timeouts_timer);
	ets_timer_arm_new(&check_timeouts_timer,lwip_timer_interval,1,1);
	uVar4 = g_ic.ic_profile.opmode;
	WDT->RST = 0x73;  /* WDT_FEED() */
	user_init_flag = 1;
	wifi_mode_set(g_ic.ic_profile.opmode);
	if ((uVar4 == '\x01') || (uVar4 == '\x03')) {
		wifi_station_start();
	}
	if (uVar4 == '\x02') {
		if (g_ic.ic_mode == '\x02') {
			wifi_softap_start(1);
			goto LAB_4022f927;
		}
	}
	else if (uVar4 != '\x03') goto LAB_4022f927;
	wifi_softap_start(0);
LAB_4022f927:
	if (uVar4 == '\x01') {
		netif_set_default(g_ic.ic_if0_conn->ni_ifp);
	}
	iVar5 = wifi_station_get_auto_connect();
	if (iVar5 == 1) {
		wifi_station_connect();
	}
	if (done_cb != (init_done_cb_t)0x0) {
		done_cb();
	}
	return;
}
#endif

void
relib_user_start(void)
{
	spi_flash_header_st flash_hdr;
	wifi_flash_header_st hbuf;
	/* Quite a bit of stack usage here for wscfg.
	 * Fortunately we * have ~5KiB of stack at this point. */
	wl_profile_st wscfg;
	int flash_speed;
	int flash_size;
	int strap = (GPIO->IN >> 16) & 7;

	/* early uart baud init */
	relib_reset_uart_baud(BOOT_CLK_FREQ);

	/* From https://github.com/esp8266/Arduino/issues/8657 this is
	 * related to flash compatibility (`fix_cache_bug` in the NONOS SDK). */
	phy_get_bb_evm();

	ets_install_putc1(user_uart_write_char);
	DPRINTF("\nrelib_user_start:\n");

