ranma/ESP8266_NONOS_SDK/third_party/relib/main/user_start.c
	SPI0->USER |= SPI_CK_I_EDGE; /* set rising edge (slave-mode only?) */

	DPRINTF("rom flash info:\n");
	DPRINTF("  device_id=%08x\n", flashchip->deviceId);
	DPRINTF("  chip_size=%08x\n", flashchip->chip_size);
	DPRINTF("  block_size=%08x\n", flashchip->block_size);
	DPRINTF("  sector_size=%08x\n", flashchip->sector_size);
	DPRINTF("  page_size=%08x\n", flashchip->page_size);
	DPRINTF("  status_mask=%08x\n", flashchip->status_mask);

	SPIRead(0, (void*)&flash_hdr, sizeof(flash_hdr));
	DPRINTF("flash_hdr: id=%02x segs=%d spiif=%d freq=%d size=%d\n",
		flash_hdr.id,
		flash_hdr.number_segs,
		flash_hdr.spi_interface,
		flash_hdr.spi_freq,
		flash_hdr.flash_size);

	if (strap != 5 /* not SDIO boot */) {
		if (flash_hdr.spi_freq < 3) {
			flash_speed = flash_hdr.spi_freq + 2;
		} else {
			if (flash_hdr.spi_freq == 0x0f) {
				flash_speed = 1;
			} else {
				flash_speed = 2;
			}
		}
	} else {
		flash_speed = 2;
	}

	switch(flash_hdr.flash_size) {
	case 0:
	default:
		/* 512KiB (256+256) */
		flash_size = 0x80000;
		break;
	case 1:
		/* 256KiB */
		flash_size = 0x40000;
		break;
	case 2:
		/* 1MiB (512+512) */
		flash_size = 0x100000;
		break;
	case 3:
		/* 2MiB (512+512) */
		flash_size = 0x200000;
		break;
	case 4:
		/* 4MiB (512+512) */
		flash_size = 0x400000;
		break;
	case 5:
		/* 2MiB (1024+1024) */
		flash_size = 0x200000;
		break;
	case 6:
		/* 4MiB (1024+1024) */
		flash_size = 0x400000;
		break;
	case 7:
		/* 4MiB (2048+2048)? */
		flash_size = 0x400000;
		break;
	case 8:
		/* 8MiB */
		flash_size = 0x800000;
		break;
	case 9:
		/* 16MiB */
		flash_size = 0x1000000;
		break;
	}
	flashchip->chip_size = flash_size;

	DPRINTF("new chip_size from hdr: %08x\n", flash_size);

	cache_map = 0;
	spi_flash_clk_sel(flash_speed);

	system_param_sector_start = (flashchip->chip_size/flashchip->sector_size) - 3;
	DPRINTF("system_param_sector_start=%08x\n", system_param_sector_start);

	uint32_t start = (system_param_sector_start + 2)*flashchip->sector_size;
	DPRINTF("SPIRead %d from @%08x\n", sizeof(hbuf), start);
	SPIRead(start, &hbuf, sizeof(hbuf));
	DPRINTF("wifi_hdr:\n");
	DPRINTF("  bank=%02x\n", hbuf.bank);
	DPRINTF("  magic1=%08x\n", hbuf.magic1);
	DPRINTF("  wr_cnt=%d\n", hbuf.wr_cnt);
	DPRINTF("  chklen0=%d\n", hbuf.chklen[0]);
	DPRINTF("  chklen1=%d\n", hbuf.chklen[1]);
	DPRINTF("  chksum0=%02x\n", hbuf.chksum[0]);
	DPRINTF("  chksum1=%02x\n", hbuf.chksum[1]);
	DPRINTF("  magic2=%08x\n", hbuf.magic2);

	start = (system_param_sector_start + (!!hbuf.bank))*flashchip->sector_size;
	DPRINTF("SPIRead %d from @%08x\n", sizeof(wscfg), start);
	SPIRead(start, &wscfg, sizeof(wscfg));
	DPRINTF("wifi_cfg:\n");
	DPRINTF("  boot.use_bin=%d\n", wscfg.boot_hdr_param.boot.use_bin);
	DPRINTF("  boot.to_qio=%d\n", wscfg.boot_hdr_param.boot.to_qio);
	DPRINTF("  boot.version=%d\n", wscfg.boot_hdr_param.boot.version);
	DPRINTF("  boot.test_bin_addr=%02x%02x%02x\n",
		wscfg.boot_hdr_param.boot.test_bin_addr[0],
		wscfg.boot_hdr_param.boot.test_bin_addr[1],
		wscfg.boot_hdr_param.boot.test_bin_addr[2]);
	DPRINTF("  boot.user_bin_addr=%02x%02x%02x\n",
		wscfg.boot_hdr_param.boot.user_bin_addr[0],
		wscfg.boot_hdr_param.boot.user_bin_addr[1],
		wscfg.boot_hdr_param.boot.user_bin_addr[2]);

	bool use_bin = userbin_check(&wscfg.boot_hdr_param.boot);
	if (flash_hdr.flash_size == 5 ||
	    flash_hdr.flash_size == 6 ||
	    flash_hdr.flash_size == 8 ||
	    flash_hdr.flash_size == 9) {
		if (wscfg.boot_hdr_param.boot_2.version < 4 ||
		    wscfg.boot_hdr_param.boot_2.version >= 32) {
			ets_printf("need boot 1.4+\n");
			while(1);
		}
		cache_map = use_bin;
	}

	if (system_correct_flash_map()) {
		ets_printf("correct flash map\r\n");
	}

	Cache_Read_Enable_New();
	init_bss_data();

	if (hbuf.magic1 == 0x55aa55aa) {
		if ((hbuf.magic2 == 0xaa55aa55) || (hbuf.magic2 == 0xffffffff)) {
			int len = hbuf.chklen[!!hbuf.bank];
			int csum = hbuf.chksum[!!hbuf.bank];
			int actual = system_get_checksum(&wscfg, len);
			if (len != 0x20 || csum != actual) {
				print_system_param_sectors(system_param_sector_start);
			} else {
				ets_printf("wscfg ok!\n");
				ets_memcpy(&g_ic.ic_profile, &wscfg, sizeof(wscfg));
			}
		} else {
			print_system_param_sectors(system_param_sector_start);
		}
	} else if (hbuf.magic1 != 0xffffffff) {
		print_system_param_sectors(system_param_sector_start);
	}
	if (wscfg.boot_hdr_param.boot.to_qio) {
		DPRINTF("user_spi_flash_dio_to_qio_pre_init\n");
		user_spi_flash_dio_to_qio_pre_init();
	}

#if 1
	install_overrides();
	relib_user_local_init();
#else
	user_local_init();
#endif
}
